Repository: ARICOMA-D365BC/AC-dynamics365smb-docs.cs-cz-OmegaT
Catalog: tm/Workflow-level2.tmx
Source language: en_us
Languages: cs_cz

source: !CAUTION If the workflow code already exists in the database, the workflow steps will be overwritten with the steps in the imported workflow.
cs_cz: !CAUTION Pokud kód workflow již v databázi existuje, kroky workflow budou přepsány kroky v importovaném workflow.

source: !CAUTION When you delete a workflow, all information in the workflow will be lost.
cs_cz: !CAUTION Když odstraníte workflow, budou ztraceny i všechny informace v něm.

source: !NOTE All notifications about workflow steps are sent through a job queue.
cs_cz: !POZNÁMKA Všechna oznámení o krocích workflow se odesílají prostřednictvím fronty úloh..

source: !NOTE Approval users, both approval requesters and approvers, must first be set up as workflow users on the Workflow User Group page.
cs_cz: !NOTE Uživatelé schvalování, žadatelé o schválení i schvalovatelé, musí být nejprve nastaveny jako uživatelé workflow na stránce Skupina uživatelů workflow .

source: !NOTE Do not enable a workflow until you are sure that the workflow is completed and that the involved workflow steps can start.
cs_cz: !NOTE<x0 /> <x1 />Nepovolujte workflow, dokud si nejste jisti, že je workflow dokončen a že lze jeho příslušné kroky zahájit.

source: !NOTE The generic version of [!INCLUDE d365fin ] offers support for restricting a record from being posted, from being exported as a payment, and from being printed as a check.
cs_cz: !NOTE Obecná verze [!INCLUDE d365fin ] nabízí podporu pro omezení záznamu v zaúčtování, v exportu jako platba a v tisku jako šek.

source: !NOTE The workflow functionality to restrict and allow records from being used is not related to the functionality to block item, customer, and vendor records from being posted.
cs_cz: !NOTE Funkce workflow, která omezuje a umožňuje použití záznamů, nesouvisí s funkcí blokování účtování položek, zákazníků a dodavatelů.

source: !NOTE To define that an approval request is not approved until multiple approvers in an approval chain have approved it, set up approvers in a hierarchy.
cs_cz: !NOTE Chcete-li definovat, že žádost o schválení nebude schválena, dokud ji neschválí více schvalovatelů v schvalovacím řetězci, nastavte schvalovatele v hierarchii.

source: !TIP To see relations between tables that are used in workflows, Choose the Lightbulb that opens the Tell Me feature Tell me what you want to do icon, and then enter Workflow – Table Relations .
cs_cz: !TIP<x0 /> <x1 />Chcete-li zobrazit vztahy mezi tabulkami, které se používají ve workflow, vyberte ikonu <x2 />Žárovky, která otevře ikonu Řekněte mi<x3 /> Řekněte mi, co chcete udělat<x4 />, a poté zadejte <x5 />Workflow - vazby tabulky<x6 />.

source: First Qualified Approver specifies that an approval request entry is only created for the requester’s first qualified approver.
cs_cz: První kvalifikovaný schvalovatel určuje, že položka požadavku na schválení je vytvořena pouze pro prvního kvalifikovaného schvalovatele žadatele.

source: Approver Chain specifies that approval request entries are created for all the requester’s approvers up to and including the first qualified approver. 2.
cs_cz: <x4 />Řetěz schvalovatelů<x5 /> určuje, že položky žádosti o schválení jsou vytvářeny pro všechny schvalovatele žadatele až do prvního kvalifikovaného schvalovatele včetně.<x6 /> 2.

source: Direct Approver specifies that an approval request entry is only created for the requester’s immediate approver, regardless of the approver’s approval limit. 3.
cs_cz: Přímý schvalovatel určuje, že položka požadavku na schválení je vytvořena pouze pro okamžitého schvalovatele žadatele, bez ohledu na limit schválení schvalovatele. 3.

source: A qualified approver is an approver whose approval limit is above the value on the request being made. The following options exist: 1.
cs_cz: Kvalifikovaný schvalovatel je osoba, jehož schvalovací limit je nad hodnotou na zadané žádosti.<X0 /><x1 /> Existují následující možnosti:<x2 /><x3 /> 1.

source: All workflow step instances that are defined in the workflow must have status Completed .
cs_cz: Všechny instance kroků workflow, které jsou ve workflow definovány, musí mít stav <x0 />Dokončeno<x1 />.

source: Alternatively, open the workflow that you want to delete.
cs_cz: Můžete také otevřít workflow, který chcete odstranit.

source: Another way to quickly create a workflow is to import an existing workflow that you have on a file outside of [!INCLUDE d365fin ].
cs_cz: Dalším způsobem rychlého vytvoření workflow je import existujícího workflow, který je mimo [! INCLUDE d365fin ].

source: Another way to quickly create workflows is to create workflows from workflow templates.
cs_cz: Dalším způsobem rychlého vytvoření workflow je vytvoření ze šablon workflow.

source: Another workflow response will allow usage of the record as defined by the workflow event and conditions.
cs_cz: Jiná odpověď workflow umožní použití záznamu podle definice událostí a podmínek workflow.

source: Approval request entries are then created according to the value in the Approver Limit Type field. For more information, see Set Up Approval Users .
cs_cz: Položky požadavku ke schvalování jsou poté vytvořeny podle hodnoty v poli <x10 />Typ limitu schvalovatele<x11 />. <X12 />Pro více informací navštivte<x13 /> Nastavení uživatelů schválení<x14 />.

source: Approver Limit Type
cs_cz: Typ limitu schvalovatele

source: Approver Type
cs_cz: Typ schvalovatele

source: Before you can create workflows that involve approval steps, you must set up the workflow users who are involved in approval processes.
cs_cz: Před vytvořením workflow zahrnujícíe kroky schválení je nutné nastavit uživatele workflow, kteří jsou zapojeni do procesů schvalování.

source: Choose the Copy From Workflow Template action.
cs_cz: Zvolte akci Nové workflow ze šablony .

source: Choose the Create Workflow from Template action.
cs_cz: Vyberte akci <x0 />Nové workflow ze šablony workflow<x1 />.

source: Choose the Delete action.
cs_cz: Vyberte akci <x0 />Odstranit<x1 />.

source: Choose the Import from File action.
cs_cz: Zvolte akci Importovat ze souboru .

source: Choose the Increase Indent and Decrease Indent buttons to indent the event name in the When field to define the step’s position in the workflow.
cs_cz: Vyberte tlačítka <x0 />Zvýšit odsazení<x1 /> a <x2 />Snížit odsazení<x3 />, chcete-li odsadit název události v poli <x4 />Když<x5 /> a definovat pozici kroku ve workflow.

source: Choose the Lightbulb that opens the Tell Me feature Tell me what you want to do icon, enter Approval User Setup , and then choose the related link.
cs_cz: Vyberte ikonu <x0 />Žárovky, která otevře ikonu Řekněte mi<x1 />Řeknete mi, co chcete dělat<x2 />, zadejte <x3 />Nastavení uživatelů schvalování<x4 /> a poté vyberte související odkaz.

source: Choose the Lightbulb that opens the Tell Me feature Tell me what you want to do icon, enter Workflows , and then choose the related link.
cs_cz: Vyberte ikonu Žárovky, která otevře funkci Řeknete mi Řeknete mi, co chcete dělat , zadejte Workflow a poté vyberte související odkaz.

source: Choose the New action.
cs_cz: Vyberte akci <x0 />New<x1 />.

source: Choose the Source Workflow Code field, and then, on the Workflow Templates page, choose the Purchase Invoice Approval Workflow workflow template.
cs_cz: Zvolte pole Kód původu pracovního postupu a na stránce Šablony workflow zvolte šablonu workflow schválení nákupní faktury.

source: Code
cs_cz: Kód

source: Code field on the Approval User Setup page determines the approver.
cs_cz: nákupčího na stránce Nastavení uživatelů schvalování určuje schvalovatele.

source: Create Workflows
cs_cz: Vytvoření Workflow

source: Create Workflows from Workflow Templates
cs_cz: Vytvoření workflow z šablony workflow

source: Create Workflows from Workflow Templates Set Up Approval Users Setting Up Workflow Notifications View Archived Workflow Step Instances Delete Workflows Walkthrough: Setting Up and Using a Purchase Approval Workflow Setting Up Workflows Using Workflows Workflow
cs_cz: Vytvoření workflow z šablony workflow<x0 /> <x1 />Nastavení uživatelů schvalování<x2 /> <x3 />Nastavení upozornění workflow<x4 /> <x5 />Zobrazení archivovaných instancí kroku workflow<x6 /> <x7 />Odstranění workflow<x8 /> <x9 />Návod: Nastavení a použití workflow schvalování nákupů<x10 /> <x11 />Nastavení workflow<x12 /> <x13 />Použití workflow<x14 /> <x15 />Workflow

source: Create Workflows Create Workflows from Workflow Templates View Archived Workflow Step Instances Delete Workflows Walkthrough: Setting Up and Using a Purchase Approval Workflow Setting Up Workflows Using Workflows Workflow
cs_cz: Vytvoření Workflow Vytvoření workflow z šablony workflow Zobrazení archivovaných instancí kroku workflow Odstranění workflow Návod: Nastavení a použití workflow schvalování nákupů Nastavení workflow Použití workflow Workflow

source: Create Workflows Enable Workflows View Archived Workflow Step Instances Walkthrough: Setting Up and Using a Purchase Approval Workflow Setting Up Workflows Using Workflows Workflow
cs_cz: Vytvoření Workflow<x0 /> <x1 />Export a import workflow<x2 /> <x3 />Zobrazení archivovaných instancí kroku workflow<x4 /> <x5 />Návod: Nastavení a použití workflow schvalování nákupů<x6 /> <x7 />Nastavení workflow<x8 /> <x9 />Použití workflow<x10 /> <x11 />Workflow

source: Create Workflows Export and Import Workflows View Archived Workflow Step Instances Delete Workflows Walkthrough: Setting Up and Using a Purchase Approval Workflow Setting Up Workflows Using Workflows Workflow
cs_cz: Vytvoření Workflow<x0 /> <x1 />Export a import workflow<x2 /> <x3 />Zobrazení archivovaných instancí kroku workflow<x4 /> <x5 />Odstranění workflow<x6 /> <x7 />Návod: Nastavení a použití workflow schvalování nákupů<x8 /> <x9 />Nastavení workflow<x10 /> <x11 />Použití workflow<x12 /> <x13 />Workflow

source: Create Workflows View Archived Workflow Step Instances Delete Workflows Setting Up Workflows Using Workflows Walkthrough: Setting Up and Using a Purchase Approval Workflow Workflow
cs_cz: Vytvoření Workflow Zobrazení archivovaných instancí kroku workflow Odstranění workflow Nastavení workflow Použití workflow Návod: Nastavení a použití workflow schvalování nákupů Workflow

source: Create Workflows Workflow
cs_cz: Vytvoření Workflow Workflow

source: Create a new line on the Approval User Setup page, and then fill the fields as described in the following table.
cs_cz: Na stránce <x0 />Nastavení uživatelů schvalování<x1 /> vytvořte nový řádek a vyplňte pole podle popisu v následující tabulce.

source: Custom Link
cs_cz: Vlastní odkaz

source: Delegate After
cs_cz: Delegovat po

source: Delete Workflows
cs_cz: Odstranění workflow

source: Description
cs_cz: Popis

source: Due Date Formula
cs_cz: Výpočet data platnosti

source: Each step consists of a workflow event moderated by event conditions and a workflow response with response options.
cs_cz: Každý krok sestává z události workflow, která je řízená podmínkami události, a odezvy workflow s možnostmi odezvy.

source: Each step consists of a workflow event, moderated by event conditions, and a workflow response, moderated by response options.
cs_cz: Každý krok sestává z události workflow, která je řízená podmínkami událostí, a odezvy workflow, která je řízená možnostmi odezvy.

source: Enable Workflows
cs_cz: Povolení workflow

source: Export and Import Workflows
cs_cz: Export a import workflowa poté vyberte související odkaz.

source: Field
cs_cz: Pole

source: For approver type Approver , set approvers up on the Approval User Setup page.
cs_cz: Pro typ Schvalovatel , nastavte schvalovatele na stránce Nastavení uživatelů schvalování .

source: For approver type, Workflow User Group , set up approvers on the Workflow User Groups page and assign the same number to each approver in the Sequence No. field.
cs_cz: Pro typ schvalovatele, Skupina uživatelů workflow , nastavte schvalovatele na stránce Skupiny uživatelů workflow a přiřaďte každému schvalovateli stejné číslo v poli >Pořadové číslo .

source: For approver type, Workflow User Group , set approvers up on the Workflow User Groups page and define the hierarchy by assigning incremental numbers to each approver in the Sequence No. field.
cs_cz: Pro typ Skupina uživatelů workflow , nastavte schvalovatele na stránce Skupiny uživatelů workflow a definujte hierarchii přiřazením dílčích čísel každému schvalovateli v poli Pořadové číslo .

source: For more information, see Create Workflows from Workflow Templates .
cs_cz: Pro více informací navštivte Vytvoření workflow z šablony workflow .

source: For more information, see Create Workflows .
cs_cz: Pro více informací navštivte Vytvoření Workflow .

source: For more information, see Export and Import Workflows .
cs_cz: Pro více informací navštivte Export a import workflow .

source: For more information, see Set Up Workflow Users .
cs_cz: Pro více informací navštivte Nastavení uživatelů workflow .

source: For more information, see Use Job Queues to Schedule Tasks .
cs_cz: Pro více informací viz Použití front úloh k plánování úkolů .

source: For more information, see Using Workflows .
cs_cz: Pro více informací navštivte Použití workflow .

source: For more information, see step 9 in Create Workflows .
cs_cz: Pro více informací navštivte krok 9 ve Vytvoření workflow .

source: For more information, see this topic and Set Up Workflow Users .
cs_cz: Pro více informací navštivte toto téma a Nastavení uživatelů workflow .

source: For workflow responses without placeholders for users, the notification recipient is typically defined by the approval user setup.
cs_cz: Pro odezvy workflow bez zástupných symbolů pro uživatele je příjemce oznámení obvykle definován nastavením uživatele pro schvalování.

source: General Journal Batch Name
cs_cz: Název listu finančního deníku

source: General Journal Template Name
cs_cz: Název šablony finančního deníku

source: If the workflow event is the change of a specific field on a record, then the Event Conditions page opens with options to select the field and the type of change.
cs_cz: Pokud je událostí workflow změna určitého pole záznamu, otevře se stránka Podmínky události s možnostmi pro výběr pole a typu změny.

source: If you are certain that a workflow is no longer being used, you can delete it.
cs_cz: Pokud jste si jisti, že se workflow již nepoužívá, můžete jej odstranit.

source: If you want to restrict a record from being used in certain activities, for example, until the record has been approved, you can incorporate two workflow responses in a workflow that controls the usage of the record.
cs_cz: Chcete-li zabránit použití záznamu v určitých aktivitách, například do doby, než bude záznam schválen, můžete do workflow zahrnout dvě odezvy workflow, které řídí použití záznamu.

source: If your business scenario requires workflow events or responses that are not supported, a Microsoft partner must implement them by customizing the application code.
cs_cz: Pokud váš obchodní scénář vyžaduje události workflow nebo odezvy, které nejsou podporovány, musí je partner společnosti Microsoft implementovat přizpůsobením kódu aplikace.

source: In the Category field, specify which category the workflow belongs to.
cs_cz: V poli Kategorie zadejte, do které kategorie workflow patří.

source: In the Code field, enter a maximum of 20 characters to identify the workflow.
cs_cz: Do pole <x0 />Kód<x1 /> zadejte maximálně 20 znaků pro identifikaci workflow.

source: In the Condition field, specify one or more conditions that must be met before the event in the When Event field can occur.
cs_cz: V poli <x0 />Ppredpoklad<x1 /> zadejte jednu nebo více podmínek, které musí být splněny, aby mohla nastat událost v poli <x2 />Když událost<x3 />.

source: In the Description field, describe the workflow.
cs_cz: V poli <x0 />Popis<x1 /> popište pracovní postup.

source: In the Operator field, select either Decreased , Increased , or Changed .
cs_cz: V poli <x0 />Operátor<x1 /> vyberte buď <x2 />Snížené<x3 />, <x4 />Zvýšené<x5 /> nebo <x6 />Změněno<x7 />.

source: In the Then Response field, specify the response that will follow when the workflow event occurs.
cs_cz: V poli <x0 />Potom odezva<x1 /> zadejte odezvu, která bude následovat, když dojde k události workflow.

source: In the When Event field, specify the event that must occur to start the workflow step.
cs_cz: V poli Když událost zadejte událost, která musí nastat ke spuštění kroku workflow.

source: Indicate that the step is one of more alternative steps that may start depending on its condition by placing the event name at the same indentation as the other alternative steps.
cs_cz: Označte, že krok je jedním z více alternativních kroků, které mohou začít v závislosti na jeho stavu umístěním názvu události na stejné odsazení jako ostatní alternativní kroky.

source: Indicate that the step is the next in the workflow sequence by indenting the event name under the event name of the previous step.
cs_cz: Označte, že krok je další v sledu workflow odsazením názvu události pod názvem události předchozího kroku.

source: Link Target Page
cs_cz: Odkaz na cílovou stránku

source: Make sure that the job queue in your installation is set up to handle workflow notifications, and that the Start Automatically From NAS check box is selected.
cs_cz: Ujistěte se, že fronta úloh ve vaší instalaci je nastavena na zpracování oznámení workflow a zda je zaškrtnuto políčko <x2 />Spustit automaticky z NAS<x3 />.

source: Note: This option is only available for workflow responses with a placeholder for a specific user.
cs_cz: Poznámka: Tato možnost je k dispozici pouze pro odezvy workflow se zástupným symbolem pro konkrétního uživatele.

source: Notice that the first two workflow steps are about restricting and then allowing usage of purchase invoices.
cs_cz: Všimněte si, že první dva kroky workflow jsou o omezení a následném povolení použití nákupních faktur.

source: On the Approval User Setup page, you also set amount limits for specific types of requests and define substitute approvers to whom approval requests are delegated when the original approver is absent.
cs_cz: Na stránce <x0 />Nastavení uživatele schválení<x1 /> také nastavíte limity množství pro konkrétní typy požadavků a definujete náhradní schvalující osoby, kterým jsou žádosti o schválení delegovány, když původní schvalující osoba chybí.

source: On the Export File page, choose the Save button.
cs_cz: Na stránce Export souboru zvolte tlačítko Uložit .

source: On the Export page, select a file location, and then choose the Save button.
cs_cz: Na stránce Export vyberte umístění souboru a pak klepněte na tlačítko Uložit .

source: On the Import page, choose the XML file that contains the workflow, and then choose the Open button.
cs_cz: Na stránce Importu zvolte soubor XML, který obsahuje workflow, a pak zvolte tlačítko Otevřít .

source: On the Options for the Selected Response FastTab, specify options for the workflow response, by selecting values in the different fields that appear, as follows:
cs_cz: Na záložce Možnosti pro vybranou odezvu můžete určit možnosti odezvy workflow výběrem hodnot v různých zobrazených polích, a to následovně:

source: On the Workflow Steps FastTab, choose the Event Conditions field, and then, for the Document Type filter, select Order .
cs_cz: Na záložce Kroky workflow zvolte pole Podmínky událostí a pak pro filtr Typ dokladu vyberte Objednávka .

source: On the Workflow page, choose the Delete action.
cs_cz: Na stránce Workflow vyberte akci Odstranit .

source: On the Workflow page, select the Enabled check box.
cs_cz: Na stránce Workflow zaškrtněte políčko Povoleno .

source: On the Workflow page, you create a workflow by listing the involved steps on the lines.
cs_cz: Na stránce Workflow vytvoříte workflow vypsáním příslušných kroků na řádcích.

source: On the Workflows page, create a new workflow named Purchase Order Approval Workflow.
cs_cz: Na stránce Workflow vytvořte nový workflow nazvaný Workflow schvalování nákupní objednávky.

source: One workflow response will restrict usage of the record as defined by the workflow event and conditions.
cs_cz: Jedna odpověď workflow omezí použití záznamu podle definice událostí a podmínek workflow.

source: Open the workflow that you want to enable.
cs_cz: Otevřete workflow, který chcete povolit.

source: Order such optional steps according to priority by placing the most important step first.
cs_cz: Tyto nepovinné kroky navolte podle priority tím, že umístíte nejdůležitější krok jako první.

source: Proceed to change the event condition on the first step of the new workflow to specify that it applies to purchase orders.
cs_cz: Přejděte ke změně podmínky události v prvním kroku nového workflow a určete tak, aby byla použita pro nákupní objednávky.

source: Proceed to create the workflow by editing the workflow steps or add new steps.
cs_cz: Pokračujte ve vytváření workflow úpravou kroků nebo přidáním nových kroků.

source: Proceed to edit, delete, or add other workflow steps to fit a business process that begins by restricting unapproved purchase orders from being posted.
cs_cz: Pokračujte v úpravách, odstranění nebo přidání dalších kroků workflow, které odpovídají obchodnímu procesu, který začíná omezením neschválených nákupních objednávek.

source: Recipient User ID
cs_cz: ID uživatele příjemce

source: Repeat steps 7 through 11 to add more workflow steps, either before or after the step that you have just created.
cs_cz: Opakováním kroků 7 až 11 přidejte další kroky workflow, buď před, nebo po kroku, který jste právě vytvořili.

source: Requesting and granting approval to create new records are typical workflow steps.
cs_cz: Vyžádání a udělení souhlasu k vytvoření nových záznamů jsou typické kroky workflow.

source: Restrict and Allow Usage of a Record
cs_cz: Omezení a povolení použití záznamu

source: Salespers./Purch.
cs_cz: Prodejce/nákupčí

source: See Also
cs_cz: Viz také

source: Select a workflow template, and then choose the OK button.
cs_cz: Vyberte šablonu workflow a poté zvolte tlačítko <x0 />OK<x1 />.

source: Select a workflow, and then choose the Export to File action.
cs_cz: Vyberte workflow a pak zvolte akci Export do souboru .

source: Select the Enabled check box to specify that the workflow will start as soon as the event on the first step of type Entry Point occurs.
cs_cz: Zaškrtnutím políčka Povoleno určíte, že workflow bude zahájen, jakmile dojde k události v prvním kroku typu Vstupní bod .

source: Select the user ID of the user who is involved in the approval process.
cs_cz: Vyberte ID uživatele, který je zapojen do schvalovacího procesu.

source: Select the workflow that you want to delete.
cs_cz: Vyberte workflow, který chcete odstranit.

source: Set Up Approval Users
cs_cz: Nastavení uživatelů schvalování

source: Set Up Email
cs_cz: Nastavení e-mailu

source: Show Confirmation Message
cs_cz: Zobrazení potvrzovací zprávu

source: Specify another page in [!INCLUDE d365fin ] that the link in the notification opens instead of the default page.
cs_cz: Zadejte jinou stránku v aplikaci [! INCLUDE d365fin ], aby se místo výchozí stránky otevřel odkaz v oznámení.

source: Specify how approvers’ approval limits affect when approval request entries are created for them.
cs_cz: Určete, jak mají být limity schválení schvalovatelů ovlivněny při vytváření položek požadavků na schválení.

source: Specify if a confirmation message is shown to users after they request an approval.
cs_cz: Zadejte, zda se uživateli zobrazí potvrzovací zpráva po vyžádání schválení.

source: Specify if and when an approval request will automatically be delegated to the relevant substitute.
cs_cz: Určete, zda a kdy bude žádost o schválení automaticky delegována na příslušného zástupce.
